![Ironhack Logo](https://i.imgur.com/1QgrNNw.png)

In [1]:
from pymongo import MongoClient
client= MongoClient('mongodb://localhost:27017')

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame

In [4]:
db = client['Company_data'] #accedo al nombre de la carpeta de la base de datos en Mongo

In [5]:
db.list_collection_names()

['Companies']

In [6]:
colc = db['Companies'] #accedo a la base de datos Companies, dentro de la carpeta 'Company_data'

In [7]:
colc.count_documents({})

18801

In [8]:
for company in colc.find().limit(2):
    print(company)

{'_id': ObjectId('52cdef7c4bab8bd675297d8a'), 'name': 'Wetpaint', 'permalink': 'abc2', 'crunchbase_url': 'http://www.crunchbase.com/company/wetpaint', 'homepage_url': 'http://wetpaint-inc.com', 'blog_url': 'http://digitalquarters.net/', 'blog_feed_url': 'http://digitalquarters.net/feed/', 'twitter_username': 'BachelrWetpaint', 'category_code': 'web', 'number_of_employees': 47, 'founded_year': 2005, 'founded_month': 10, 'founded_day': 17, 'deadpooled_year': 1, 'tag_list': 'wiki, seattle, elowitz, media-industry, media-platform, social-distribution-system', 'alias_list': '', 'email_address': 'info@wetpaint.com', 'phone_number': '206.859.6300', 'description': 'Technology Platform Company', 'created_at': datetime.datetime(2007, 5, 25, 6, 51, 27), 'updated_at': 'Sun Dec 08 07:15:44 UTC 2013', 'overview': '<p>Wetpaint is a technology platform company that uses its proprietary state-of-the-art technology and expertise in social media to build and monetize audiences for digital publishers. Wetpaint’s own online property, Wetpaint Entertainment, an entertainment news site that attracts more than 12 million unique visitors monthly and has over 2 million Facebook fans, is a proof point to the company’s success in building and engaging audiences. Media companies can license Wetpaint’s platform which includes a dynamic playbook tailored to their individual needs and comprehensive training. Founded by Internet pioneer Ben Elowitz, and with offices in New York and Seattle, Wetpaint is backed by Accel Partners, the investors behind Facebook.</p>', 'image': {'available_sizes': [[[150, 75], 'assets/images/resized/0000/3604/3604v14-max-150x150.jpg'], [[250, 125], 'assets/images/resized/0000/3604/3604v14-max-250x250.jpg'], [[450, 225], 'assets/images/resized/0000/3604/3604v14-max-450x450.jpg']]}, 'products': [{'name': 'Wikison Wetpaint', 'permalink': 'wetpaint-wiki'}, {'name': 'Wetpaint Social Distribution System', 'permalink': 'wetpaint-social-distribution-system'}], 'relationships': [{'is_past': False, 'title': 'Co-Founder and VP, Social and Audience Development', 'person': {'first_name': 'Michael', 'last_name': 'Howell', 'permalink': 'michael-howell'}}, {'is_past': False, 'title': 'Co-Founder/CEO/Board of Directors', 'person': {'first_name': 'Ben', 'last_name': 'Elowitz', 'permalink': 'ben-elowitz'}}, {'is_past': False, 'title': 'COO/Board of Directors', 'person': {'first_name': 'Rob', 'last_name': 'Grady', 'permalink': 'rob-grady'}}, {'is_past': False, 'title': 'SVP, Strategy and Business Development', 'person': {'first_name': 'Chris', 'last_name': 'Kollas', 'permalink': 'chris-kollas'}}, {'is_past': False, 'title': 'Board', 'person': {'first_name': 'Theresia', 'last_name': 'Ranzetta', 'permalink': 'theresia-ranzetta'}}, {'is_past': False, 'title': 'Board Member', 'person': {'first_name': 'Gus', 'last_name': 'Tai', 'permalink': 'gus-tai'}}, {'is_past': False, 'title': 'Board', 'person': {'first_name': 'Len', 'last_name': 'Jordan', 'permalink': 'len-jordan'}}, {'is_past': False, 'title': 'Head of Technology and Product', 'person': {'first_name': 'Alex', 'last_name': 'Weinstein', 'permalink': 'alex-weinstein'}}, {'is_past': True, 'title': 'CFO', 'person': {'first_name': 'Bert', 'last_name': 'Hogue', 'permalink': 'bert-hogue'}}, {'is_past': True, 'title': 'CFO/ CRO', 'person': {'first_name': 'Brian', 'last_name': 'Watkins', 'permalink': 'brian-watkins'}}, {'is_past': True, 'title': 'Senior Vice President, Marketing', 'person': {'first_name': 'Rob', 'last_name': 'Grady', 'permalink': 'rob-grady'}}, {'is_past': True, 'title': 'VP, Technology and Product', 'person': {'first_name': 'Werner', 'last_name': 'Koepf', 'permalink': 'werner-koepf'}}, {'is_past': True, 'title': 'VP Marketing', 'person': {'first_name': 'Kevin', 'last_name': 'Flaherty', 'permalink': 'kevin-flaherty'}}, {'is_past': True, 'title': 'VP User Experience', 'person': {'first_name': 'Alex', 'last_name': 'Berg', 'permalink': 'alex-berg'}}, {'is_past': True, 'title': 'VP Engineering', 'person': {'first_name': 'Steve', 'last_name': 'McQuade', 'permalink': 'steve-mcquade'}}, {'is_past': True, 'title': 'Executive Editor', 'person': {'first_name': 'Susan', 'last_name': 'Mulcahy', 'permalink': 'susan-mulcahy'}}, {'is_past': True, 'title': 'VP Business Development', 'person': {'first_name': 'Chris', 'last_name': 'Kollas', 'permalink': 'chris-kollas'}}], 'competitions': [{'competitor': {'name': 'Wikia', 'permalink': 'wikia'}}, {'competitor': {'name': 'JotSpot', 'permalink': 'jotspot'}}, {'competitor': {'name': 'Socialtext', 'permalink': 'socialtext'}}, {'competitor': {'name': 'Ning by Glam Media', 'permalink': 'ning'}}, {'competitor': {'name': 'Soceeo', 'permalink': 'soceeo'}}, {'competitor': {'name': 'Yola', 'permalink': 'yola'}}, {'competitor': {'name': 'SocialGO', 'permalink': 'socialgo'}}, {'competitor': {'name': 'IslamNor', 'permalink': 'islamnor'}}], 'providerships': [], 'total_money_raised': '$39.8M', 'funding_rounds': [{'id': 888, 'round_code': 'a', 'source_url': 'http://seattlepi.nwsource.com/business/246734_wiki02.html', 'source_description': '', 'raised_amount': 5250000, 'raised_currency_code': 'USD', 'funded_year': 2005, 'funded_month': 10, 'funded_day': 1, 'investments': [{'company': None, 'financial_org': {'name': 'Frazier Technology Ventures', 'permalink': 'frazier-technology-ventures'}, 'person': None}, {'company': None, 'financial_org': {'name': 'Trinity Ventures', 'permalink': 'trinity-ventures'}, 'person': None}]}, {'id': 889, 'round_code': 'b', 'source_url': 'http://pulse2.com/2007/01/09/wiki-builder-website-wetpaint-welcomes-95m-funding/', 'source_description': '', 'raised_amount': 9500000, 'raised_currency_code': 'USD', 'funded_year': 2007, 'funded_month': 1, 'funded_day': 1, 'investments': [{'company': None, 'financial_org': {'name': 'Accel Partners', 'permalink': 'accel-partners'}, 'person': None}, {'company': None, 'financial_org': {'name': 'Frazier Technology Ventures', 'permalink': 'frazier-technology-ventures'}, 'person': None}, {'company': None, 'financial_org': {'name': 'Trinity Ventures', 'permalink': 'trinity-ventures'}, 'person': None}]}, {'id': 2312, 'round_code': 'c', 'source_url': 'http://www.accel.com/news/news_one_up.php?news_id=185', 'source_description': 'Accel', 'raised_amount': 25000000, 'raised_currency_code': 'USD', 'funded_year': 2008, 'funded_month': 5, 'funded_day': 19, 'investments': [{'company': None, 'financial_org': {'name': 'DAG Ventures', 'permalink': 'dag-ventures'}, 'person': None}, {'company': None, 'financial_org': {'name': 'Accel Partners', 'permalink': 'accel-partners'}, 'person': None}, {'company': None, 'financial_org': {'name': 'Trinity Ventures', 'permalink': 'trinity-ventures'}, 'person': None}, {'company': None, 'financial_org': {'name': 'Frazier Technology Ventures', 'permalink': 'frazier-technology-ventures'}, 'person': None}]}], 'investments': [], 'acquisition': {'price_amount': 30000000, 'price_currency_code': 'USD', 'term_code': 'cash_and_stock', 'source_url': 'http://allthingsd.com/20131216/viggle-tries-to-bulk-up-its-social-tv-business-by-buying-wetpaint/?mod=atdtweet', 'source_description': ' Viggle Tries to Bulk Up Its Social TV Business by Buying Wetpaint', 'acquired_year': 2013, 'acquired_month': 12, 'acquired_day': 16, 'acquiring_company': {'name': 'Viggle', 'permalink': 'viggle'}}, 'acquisitions': [], 'offices': [{'description': '', 'address1': '710 - 2nd Avenue', 'address2': 'Suite 1100', 'zip_code': '98104', 'city': 'Seattle', 'state_code': 'WA', 'country_code': 'USA', 'latitude': 47.603122, 'longitude': -122.333253}, {'description': '', 'address1': '270 Lafayette Street', 'address2': 'Suite 505', 'zip_code': '10012', 'city': 'New York', 'state_code': 'NY', 'country_code': 'USA', 'latitude': 40.7237306, 'longitude': -73.9964312}], 'milestones': [{'id': 5869, 'description': "Wetpaint named in Lead411's Hottest Seattle Companies list", 'stoned_year': 2010, 'stoned_month': 6, 'stoned_day': 8, 'source_url': 'http://www.lead411.com/seattle-companies.html', 'source_text': None, 'source_description': 'LEAD411 LAUNCHES "HOTTEST SEATTLE COMPANIES" AWARDS', 'stoneable_type': 'Company', 'stoned_value': None, 'stoned_value_type': None, 'stoned_acquirer': None, 'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}}, {'id': 8702, 'description': 'Site-Builder Wetpaint Makes One For Itself, Using the Demand Media Playbook', 'stoned_year': 2010, 'stoned_month': 9, 'stoned_day': 6, 'source_url': 'http://mediamemo.allthingsd.com/20100906/site-builder-wetpaint-makes-one-for-itself-using-the-demand-media-playbook/', 'source_text': None, 'source_description': 'All Things D', 'stoneable_type': 'Company', 'stoned_value': None, 'stoned_value_type': None, 'stoned_acquirer': None, 'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}}], 'video_embeds': [], 'screenshots': [{'available_sizes': [[[150, 86], 'assets/images/resized/0016/0929/160929v2-max-150x150.png'], [[250, 143], 'assets/images/resized/0016/0929/160929v2-max-250x250.png'], [[450, 258], 'assets/images/resized/0016/0929/160929v2-max-450x450.png']], 'attribution': None}], 'external_links': [{'external_url': 'http://www.geekwire.com/2011/rewind-ben-elowitz-wetpaint-ceo-building-type-media-company', 'title': 'GeekWire interview: Rewind - Ben Elowitz, Wetpaint CEO, on building a new type of media company'}, {'external_url': 'http://techcrunch.com/2012/06/17/search-and-social-how-two-will-soon-become-one/', 'title': 'Guest post by CEO Ben Elowitz in TechCrunch'}, {'external_url': 'http://allthingsd.com/20120516/what-to-expect-when-facebook-is-expecting-five-predictions-for-facebooks-first-public-year/', 'title': 'Guest post by CEO Ben Elowitz in AllThingsD'}, {'external_url': 'http://adage.com/article/digitalnext/facebook-biggest-player-advertising-s-540-billion-world/235708/', 'title': 'Guest post by CEO Ben Elowitz in AdAge'}, {'external_url': 'http://www.businessinsider.com/facebook-captures-14-percent-of-our-online-attention-but-only-4-percent-of-ad-spending-online-2012-6', 'title': 'Guest post by CEO Ben Elowitz in Business Insider'}, {'external_url': 'http://allfacebook.com/wetpaint-media-data_b75963', 'title': 'AllFacebook coverage of Wetpaint'}, {'external_url': 'http://adage.com/article/digital/celeb-site-wetpaint-shows-media-profit-facebook/237828/', 'title': 'Profile of Wetpaint in Ad Age'}, {'external_url': 'http://allthingsd.com/20121018/how-to-boost-your-facebook-traffic-tips-and-tricks-from-wetpaint/', 'title': 'Interview with Wetpaint CEO Ben Elowitz in All Things D'}, {'external_url': 'http://www.xconomy.com/seattle/2012/10/19/wetpaint-starts-licensing-its-facebook-based-media-distribution-tech/', 'title': 'Profile of Wetpaint in Xconomy'}], 'partners': []}
{'_id': ObjectId('52cdef7c4bab8bd675297d8b'), 'name': 'AdventNet', 'permalink': 'abc3', 'crunchbase_url': 'http://www.crunchbase.com/company/adventnet', 'homepage_url': 'http://adventnet.com', 'blog_url': '', 'blog_feed_url': '', 'twitter_username': 'manageengine', 'category_code': 'enterprise', 'number_of_employees': 600, 'founded_year': 1996, 'deadpooled_year': 2, 'tag_list': '', 'alias_list': 'Zoho ManageEngine ', 'email_address': 'pr@adventnet.com', 'phone_number': '925-924-9500', 'description': 'Server Management Software', 'created_at': datetime.datetime(2007, 5, 25, 19, 24, 22), 'updated_at': 'Wed Oct 31 18:26:09 UTC 2012', 'overview': '<p>AdventNet is now <a href="/company/zoho-manageengine" title="Zoho ManageEngine" rel="nofollow">Zoho ManageEngine</a>.</p>\n\n<p>Founded in 1996, AdventNet has served a diverse range of enterprise IT, networking and telecom customers.</p>\n\n<p>AdventNet supplies server and network management software.</p>', 'image': {'available_sizes': [[[150, 55], 'assets/images/resized/0001/9732/19732v1-max-150x150.png'], [[150, 55], 'assets/images/resized/0001/9732/19732v1-max-250x250.png'], [[150, 55], 'assets/images/resized/0001/9732/19732v1-max-450x450.png']]}, 'products': [], 'relationships': [{'is_past': True, 'title': 'CEO and Co-Founder', 'person': {'first_name': 'Sridhar', 'last_name': 'Vembu', 'permalink': 'sridhar-vembu'}}, {'is_past': True, 'title': 'VP of Business Dev', 'person': {'first_name': 'Neil', 'last_name': 'Butani', 'permalink': 'neil-butani'}}, {'is_past': True, 'title': 'Usabiliy Engineer', 'person': {'first_name': 'Bharath', 'last_name': 'Balasubramanian', 'permalink': 'bharath-balasibramanian'}}, {'is_past': True, 'title': 'Director of Engineering', 'person': {'first_name': 'Rajendran', 'last_name': 'Dandapani', 'permalink': 'rajendran-dandapani'}}, {'is_past': True, 'title': 'Market Analyst', 'person': {'first_name': 'Aravind', 'last_name': 'Natarajan', 'permalink': 'aravind-natarajan'}}, {'is_past': True, 'title': 'Director of Product Management', 'person': {'first_name': 'Hyther', 'last_name': 'Nizam', 'permalink': 'hyther-nizam'}}, {'is_past': True, 'title': 'Western Regional OEM Sales Manager', 'person': {'first_name': 'Ian', 'last_name': 'Wenig', 'permalink': 'ian-wenig'}}], 'competitions': [], 'providerships': [{'title': 'DHFH', 'is_past': True, 'provider': {'name': 'A Small Orange', 'permalink': 'a-small-orange'}}], 'total_money_raised': '$0', 'funding_rounds': [], 'investments': [], 'acquisition': None, 'acquisitions': [], 'offices': [{'description': 'Headquarters', 'address1': '4900 Hopyard Rd.', 'address2': 'Suite 310', 'zip_code': '94588', 'city': 'Pleasanton', 'state_code': 'CA', 'country_code': 'USA', 'latitude': 37.692934, 'longitude': -121.904945}], 'milestones': [], 'video_embeds': [], 'screenshots': [{'available_sizes': [[[150, 94], 'assets/images/resized/0004/3400/43400v1-max-150x150.png'], [[250, 156], 'assets/images/resized/0004/3400/43400v1-max-250x250.png'], [[450, 282], 'assets/images/resized/0004/3400/43400v1-max-450x450.png']], 'attribution': None}], 'external_links': [], 'partners': []}

# Answers
### 1. All the companies that it's name match 'Babelgum'. Retrieve only their `name` field.

In [9]:
df(colc.find({'name':'Babelgum'},{'name':1,'_id':0}))

       name
0  Babelgum

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [10]:
df(colc.find({'number_of_employees': {'$gt':5000}},
            {'name':1,'number_of_employees':1,'_id':0}).limit(20).sort('number_of_employees',-1))

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                 Bertelsmann               100000
19                                     Comcast               100000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fileds.

In [11]:
df(colc.find({'founded_year': {'$gte':2000,'$lte':2005}},
            {'name':1,'founded_year':1,'_id':0}).sort('founded_year',1))

                          name  founded_year
0                     AllofMP3          2000
1                       Steorn          2000
2                       MeeVee          2000
3                     PhotoBox          2000
4                       Boonex          2000
...                        ...           ...
3729               Swiftprosys          2005
3730    Events Computer Design          2005
3731  Total Telecom Consulting          2005
3732                  iPartyTV          2005
3733      Mu-Gahat Enterprises          2005

[3734 rows x 2 columns]

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [12]:
df((colc.find({'ipo.valuation_amount': {'$gt':100000000},'founded_year':{'$lt':2010}},
             { 'name':1,'ipo.valuation_amount':1,'_id':0 })))

                    name                                 ipo
0               Facebook  {'valuation_amount': 104000000000}
1                Twitter   {'valuation_amount': 18100000000}
2                   Yelp    {'valuation_amount': 1300000000}
3               LinkedIn    {'valuation_amount': 9310000000}
4                 Amazon  {'valuation_amount': 100000000000}
5             Brightcove     {'valuation_amount': 290000000}
6            KIT digital     {'valuation_amount': 235000000}
7                Nielsen    {'valuation_amount': 1600000000}
8              OpenTable    {'valuation_amount': 1050000000}
9         ChannelAdvisor     {'valuation_amount': 287000000}
10         Jive Software    {'valuation_amount': 1000000000}
11                Zillow    {'valuation_amount': 2550000000}
12                   Wix     {'valuation_amount': 750000000}
13            Shutterfly     {'valuation_amount': 350000000}
14           TripAdvisor    {'valuation_amount': 3273770000}
15            Salesforce     {'valuation_amount': 110000000}
16              HomeAway    {'valuation_amount': 3000000000}
17            QuinStreet     {'valuation_amount': 140000000}
18             Rackspace    {'valuation_amount': 5440000000}
19          BMC Software    {'valuation_amount': 6000000000}
20            Higher One    {'valuation_amount': 1060000000}
21              Infoblox     {'valuation_amount': 824000000}
22               Tencent   {'valuation_amount': 11000000000}
23               Marketo     {'valuation_amount': 465000000}
24                 Baidu    {'valuation_amount': 4000000000}
25               Geeknet     {'valuation_amount': 134000000}
26               Opsware     {'valuation_amount': 450000000}
27               Telenav     {'valuation_amount': 337000000}
28        Rally Software     {'valuation_amount': 315000000}
29   BrightSource Energy    {'valuation_amount': 1000000000}
30                  Mixi     {'valuation_amount': 970000000}
31              QlikTech    {'valuation_amount': 1000000000}
32                 Chegg    {'valuation_amount': 1100000000}
33                 Chegg    {'valuation_amount': 1100000000}
34               Groupon   {'valuation_amount': 12800000000}
35            SolarWinds     {'valuation_amount': 803000000}
36                  GREE  {'valuation_amount': 108960000000}
37                 Tudou     {'valuation_amount': 174000000}
38             DemandTec     {'valuation_amount': 245000000}
39  Cornerstone OnDemand     {'valuation_amount': 900000000}
40       Western Digital    {'valuation_amount': 9430000000}
41      Millennial Media     {'valuation_amount': 973500000}

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [13]:
df(colc.find({'number_of_employees':{'$lt':1000},'founded_year':{'$gt':2005}},
            {'name':1,'number_of_employees':1,'founded_year':1,'_id':0}).limit(10).sort('number_of_employees',-1))

                      name  number_of_employees  founded_year
0  Relax Solutions Pvt Ltd                  900          2006
1                   InMobi                  900          2007
2                  4shared                  666          2011
3                    Kabam                  650          2006
4                  HubSpot                  650          2006
5                   Square                  600          2009
6                 Linekong                  600          2007
7  i365, A Seagate Company                  550          2008
8                    Vostu                  550          2007
9                   TaskUs                  540          2008

### 6. All the companies that don't include the `partners` field.

In [14]:
df(colc.find({'partners': {'$ne': False}},
            {'name':1,'partners':1,'_id':0}))

                      name partners
0                 Wetpaint       []
1                AdventNet       []
2                     Zoho       []
3                     Digg       []
4                 Facebook       []
...                    ...      ...
18796               Adhunk       []
18797           AfterLogic       []
18798          goBookmaker       []
18799  EnteGreat Solutions       []
18800            EnteGreat       []

[18801 rows x 2 columns]

### 7. All the companies that have a null type of value on the `category_code` field.

In [15]:
df(colc.find({'category_code': {'$eq': None}},
            {'name':1,'category_code':1,'_id':0}))

              name category_code
0       Collective          None
1          Snimmer          None
2           KoolIM          None
3     Level9 Media          None
4          VidKing          None
...            ...           ...
2746        Nellix          None
2747      Cantimer          None
2748  cruisecritic          None
2749      Coloroot          None
2750      Geekdive          None

[2751 rows x 2 columns]

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [16]:
df(colc.find({'number_of_employees':{'$gt':100,'$lt':1000}},
            {'name':1,'number_of_employees':1,'_id': 0, }).sort('number_of_employees',-1))

                                name  number_of_employees
0                        Datamonitor                  984
1               Infinera Corporation                  974
2                                Box                  950
3    NorthPoint Communications Group                  948
4                       888 Holdings                  931
..                               ...                  ...
748                           GoGrid                  102
749                 OSA Technologies                  102
750                OfficialVirtualDJ                  102
751                            KAYAK                  101
752                            Jedox                  101

[753 rows x 2 columns]

### 9. Order all the companies by their IPO price descendently.

In [17]:
df((colc.find({'ipo.valuation_amount':{'$exists':True}},
             {'name':1,'ipo.valuation_amount':1,'_id':0}).sort('ipo.valuation_amount',-1)))

                   name                                 ipo
0                  GREE  {'valuation_amount': 108960000000}
1              Facebook  {'valuation_amount': 104000000000}
2                Amazon  {'valuation_amount': 100000000000}
3               Twitter   {'valuation_amount': 18100000000}
4               Groupon   {'valuation_amount': 12800000000}
..                  ...                                 ...
385           InfoLogix          {'valuation_amount': None}
386                 INX          {'valuation_amount': None}
387  Oxford Instruments          {'valuation_amount': None}
388  Zebra Technologies          {'valuation_amount': None}
389              Lenovo          {'valuation_amount': None}

[390 rows x 2 columns]

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [18]:
df(colc.find({'number_of_employees':{'$exists': True}},
                {'name':1, 'number_of_employees':1,'_id':0}).sort('number_of_employees', -1).limit(10))

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000